#include <string>
#include <iostream>
using namespace std;
string a,b;
int main(){
	cin>>a>>b;
	if(a=="пн"){
			if(b=="чис"){
				cout<<"08:20-09:50"<<"  "<<"Информатика и прграмирование"<<'\n';
				cout<<"10:00-11:35"<<"  "<<"Введение в специальность"<<'\n';
				cout<<"12:05-13:40"<<"  "<<"Алгебра и геометрия"<<'\n';
				cout<<"13:50-15:25"<<"  "<<"---------"<<'\n';
			}else{
				cout<<"08:20-09:50"<<"  "<<"Информатика и прграмирование"<<'\n';
				cout<<"10:00-11:35"<<"  "<<"Введение в специальность"<<'\n';
				cout<<"12:05-13:40"<<"  "<<"Алгебра и геометрия"<<'\n';
				cout<<"13:50-15:25"<<"  "<<"---------"<<'\n';
			}
	}
	if(a=="вт"){
			if(b=="чис"){
				cout<<"08:20-09:50"<<"  "<<"---------"<<'\n';
				cout<<"10:00-11:35"<<"  "<<"Математический анализ"<<'\n';
				cout<<"12:05-13:40"<<"  "<<"Русский язык и культура речи"<<'\n';
				cout<<"13:50-15:25"<<"  "<<"Иностанный язык"<<'\n';
			}else{
				cout<<"08:20-09:50"<<"  "<<"---------"<<'\n';
				cout<<"10:00-11:35"<<"  "<<"Информатика и програмирование"<<'\n';
				cout<<"12:05-13:40"<<"  "<<"Русский язык и культура речи"<<'\n';
				cout<<"13:50-15:25"<<"  "<<"Иностанный язык"<<'\n';
			}
	}
	if(a=="ср"){
			if(b=="чис"){
				cout<<"08:20-09:50"<<"  "<<"---------"<<'\n';
				cout<<"10:00-11:35"<<"  "<<"---------"<<'\n';
				cout<<"12:05-13:40"<<"  "<<"---------"<<'\n';
				cout<<"13:50-15:25"<<"  "<<"---------"<<'\n';
			}else{
				cout<<"08:20-09:50"<<"  "<<"---------"<<'\n';
				cout<<"10:00-11:35"<<"  "<<"---------"<<'\n';
				cout<<"12:05-13:40"<<"  "<<"---------"<<'\n';
				cout<<"13:50-15:25"<<"  "<<"---------"<<'\n';
			}
	}
	if(a=="чт"){
			if(b=="чис"){
				cout<<"08:20-09:50"<<"  "<<"---------"<<'\n';
				cout<<"10:00-11:35"<<"  "<<"---------"<<'\n';
				cout<<"12:05-13:40"<<"  "<<"---------"<<'\n';
				cout<<"13:50-15:25"<<"  "<<"---------"<<'\n';
			}else{
				cout<<"08:20-09:50"<<"  "<<"---------"<<'\n';
				cout<<"10:00-11:35"<<"  "<<"---------"<<'\n';
				cout<<"12:05-13:40"<<"  "<<"---------"<<'\n';
				cout<<"13:50-15:25"<<"  "<<"---------"<<'\n';
			}
	}
	if(a=="пт"){
			if(b=="чис"){
				cout<<"08:20-09:50"<<"  "<<"Информатика и програмирование"<<'\n';
				cout<<"10:00-11:35"<<"  "<<"Алгебра и геометрия"<<'\n';
				cout<<"12:05-13:40"<<"  "<<"Математический анализ"<<'\n';
				cout<<"13:50-15:25"<<"  "<<"Иностанный язык"<<'\n';
			}else{
				cout<<"08:20-09:50"<<"  "<<"Информатика и програмирование"<<'\n';
				cout<<"10:00-11:35"<<"  "<<"Алгебра и геометрия"<<'\n';
				cout<<"12:05-13:40"<<"  "<<"Математический анализ"<<'\n';
				cout<<"13:50-15:25"<<"  "<<"Иностанный язык"<<'\n';
			}
	}
	if(a=="сб"){
			if(b=="чис"){
				cout<<"08:20-09:50"<<"  "<<"---------"<<'\n';
				cout<<"10:00-11:35"<<"  "<<"История"<<'\n';
				cout<<"12:05-13:40"<<"  "<<"Физическая культура и спорт"<<'\n';
				cout<<"13:50-15:25"<<"  "<<"Математический анализ"<<'\n';
			}else{
				cout<<"08:20-09:50"<<"  "<<"---------"<<'\n';
				cout<<"10:00-11:35"<<"  "<<"История"<<'\n';
				cout<<"12:05-13:40"<<"  "<<"Физическая культура и спорт"<<'\n';
				cout<<"13:50-15:25"<<"  "<<"История"<<'\n';
			}
	}
}
